#+LATEX_HEADER_EXTRA: \usepackage{tikz-timing}[2009/12/09]
#+LATEX_HEADER_EXTRA: \usetikztiminglibrary[new={char=Q,reset char=R}]{counters}
#+LATEX_HEADER_EXTRA: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER_EXTRA: \usepackage[active,tightpage]{preview}
#+LATEX_HEADER_EXTRA: \setlength{\PreviewBorder}{5mm}

#+LATEX_HEADER_EXTRA: \definecolor{bgblue}{rgb}{0.5,0.9,0.9}
#+LATEX_HEADER_EXTRA: \definecolor{bgred}{rgb}{1,0.6,0.6}
#+LATEX_HEADER_EXTRA: \definecolor{fgblue}{rgb}{0,0,0.6}
#+LATEX_HEADER_EXTRA: \definecolor{bgred}{rgb}{0.6,,0}

*** DONE AUIPC
    CLOSED: [2017-03-13 Mon 10:13]
    :PROPERTIES:
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-04 Sat 06:57]--[2017-03-04 Sat 07:08] =>  0:11
    :LOGBOOK:  
    CLOCK: [2017-03-02 Thu 14:00]--[2017-03-02 Thu 14:01] =>  0:01
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE JAL
    CLOSED: [2017-03-17 Fri 17:25]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-17 Fri 17:01]--[2017-03-17 Fri 17:25] =>  0:24
    :END:      
    :PROPERTIES:
    :Effort:   0:45
    :END:
*** DONE JALR
    CLOSED: [2017-03-20 Mon 10:50]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-20 Mon 10:50]--[2017-03-20 Mon 10:51] =>  0:01
    CLOCK: [2017-03-20 Mon 10:20]--[2017-03-20 Mon 10:50] =>  0:30
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE BEQ
    CLOSED: [2017-03-20 Mon 11:58]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-20 Mon 10:51]--[2017-03-20 Mon 11:06] =>  0:15
    :END:      
    :PROPERTIES:
    :Effort:   0:45
    :END:
*** DONE BNE
    CLOSED: [2017-03-21 Tue 09:14]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-21 Tue 08:58]--[2017-03-21 Tue 09:14] =>  0:16
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE BLT
    CLOSED: [2017-03-22 Wed 09:55]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-22 Wed 09:51]--[2017-03-22 Wed 09:55] =>  0:04
    CLOCK: [2017-03-22 Wed 09:22]--[2017-03-22 Wed 09:43] =>  0:21
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE BGE
    CLOSED: [2017-03-23 Thu 12:22]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-23 Thu 07:52]--[2017-03-23 Thu 08:10] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE BLTU
    CLOSED: [2017-03-27 Mon 12:44]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-27 Mon 11:31]--[2017-03-27 Mon 11:35] =>  0:04
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE BGEU
    CLOSED: [2017-03-27 Mon 13:00]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-27 Mon 12:48]--[2017-03-27 Mon 12:59] =>  0:11
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LB
    CLOSED: [2017-02-20 Mon 11:19]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-20 Mon 10:10]--[2017-02-20 Mon 11:19] =>  1:09
    CLOCK: [2017-02-20 Mon 08:46]--[2017-02-20 Mon 08:58] =>  0:12
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LH
    CLOSED: [2017-02-20 Mon 12:18]
    :PROPERTIES:
    :END:
    :LOGBOOK:
    CLOCK: [2017-02-20 Mon 12:02]--[2017-02-20 Mon 12:18] =>  0:16
    :END:
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LBU
    CLOSED: [2017-02-27 Mon 08:06]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 07:48]--[2017-02-27 Mon 08:06] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LHU
    CLOSED: [2017-02-27 Mon 09:45]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 09:28]--[2017-02-27 Mon 09:45] =>  0:17
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SB
    CLOSED: [2017-02-22 Wed 13:16]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-22 Wed 12:54]--[2017-02-22 Wed 13:16] =>  0:22
    CLOCK: [2017-02-21 Tue 07:51]--[2017-02-21 Tue 08:59] =>  1:08
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SH
    CLOSED: [2017-02-23 Thu 09:15]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-23 Thu 08:33]--[2017-02-23 Thu 09:15] =>  0:42
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE ADDI
    CLOSED: [2017-02-13 Mon 12:28]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-13 Mon 10:23]--[2017-02-13 Mon 11:05] =>  0:42
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTI
    CLOSED: [2017-02-16 Thu 18:50]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-16 Thu 18:24]--[2017-02-16 Thu 18:50] =>  0:26
    CLOCK: [2017-02-15 Wed 10:09]--[2017-02-15 Wed 10:52] =>  0:43
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTIU
    CLOSED: [2017-02-16 Thu 19:02]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-16 Thu 18:50]--[2017-02-16 Thu 19:02] =>  0:12
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE XORI
    CLOSED: [2017-02-15 Wed 08:04]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-14 Tue 11:29]--[2017-02-14 Tue 12:45] =>  1:16
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE ORI
    CLOSED: [2017-02-05 Sun 17:55]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 15:34]--[2017-02-05 Sun 17:56] =>  2:22
    :END:
*** DONE ANDI
    CLOSED: [2017-02-05 Sun 18:17]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 17:57]--[2017-02-05 Sun 18:17] =>  0:20
    :END:
*** DONE SLLI
    CLOSED: [2017-02-05 Sun 20:16]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 19:36]--[2017-02-05 Sun 20:16] =>  0:40
    :END:
*** DONE SRLI
    CLOSED: [2017-02-13 Mon 07:34]
    :PROPERTIES:
    :END:
    :LOGBOOK:
    CLOCK: [2017-02-13 Mon 07:34]--[2017-02-13 Mon 07:54] =>  0:20
    CLOCK: [2017-02-13 Mon 07:33]--[2017-02-13 Mon 07:34] =>  0:01
    :END:
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRAI
    CLOSED: [2017-02-13 Mon 08:55]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-13 Mon 07:54]--[2017-02-13 Mon 08:55] =>  1:01
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLL
    CLOSED: [2017-02-05 Sun 17:57]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-01 Wed 16:33]--[2017-02-01 Wed 17:57] =>  1:24
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLT
    CLOSED: [2017-02-20 Mon 08:18]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-17 Fri 08:00]--[2017-02-17 Fri 08:18] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTU
    CLOSED: [2017-02-20 Mon 08:45]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-20 Mon 08:45]--[2017-02-20 Mon 08:46] =>  0:01
    CLOCK: [2017-02-20 Mon 08:18]--[2017-02-20 Mon 08:45] =>  0:27
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE XOR
    CLOSED: [2017-02-15 Wed 09:04]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 08:04]--[2017-02-15 Wed 09:04] =>  1:00
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRL
    CLOSED: [2017-02-28 Tue 07:58]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 17:54]--[2017-02-27 Mon 18:11] =>  0:17
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRA
    CLOSED: [2017-02-28 Tue 08:51]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-28 Tue 08:00]--[2017-02-28 Tue 08:51] =>  0:51
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE OR
    CLOSED: [2017-02-15 Wed 09:13]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 09:13]--[2017-02-15 Wed 09:15] =>  0:02
    CLOCK: [2017-02-15 Wed 09:04]--[2017-02-15 Wed 09:13] =>  0:09
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE AND
    CLOSED: [2017-02-15 Wed 09:54]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 09:15]--[2017-02-15 Wed 09:26] =>  0:11
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
** DONE test with RVld fixed to 1
   CLOSED: [2017-03-27 Mon 14:01]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-27 Mon 13:08]--[2017-03-27 Mon 14:01] =>  0:53
   :END:      
   :PROPERTIES:
   :Effort:   0:30
   :END:
** DONE add error handler in testbench
   CLOSED: [2017-02-15 Wed 09:30]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-02-15 Wed 09:30]--[2017-02-15 Wed 09:53] =>  0:23
   CLOCK: [2017-02-15 Wed 09:29]--[2017-02-15 Wed 09:30] =>  0:01
   :END:      
   :PROPERTIES:
   :Effort:   0:10
   :END:
** DONE add generating error in rtl
   CLOSED: [2017-02-15 Wed 09:29]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-02-15 Wed 09:26]--[2017-02-15 Wed 09:29] =>  0:03
   :END:      
   :PROPERTIES:
   :Effort:   0:10
   :END:
** DONE add support to labels in assembler
   CLOSED: [2017-03-01 Wed 11:28]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-01 Wed 09:21]--[2017-03-01 Wed 11:28] =>  2:07
   CLOCK: [2017-02-28 Tue 08:54]--[2017-02-28 Tue 08:58] =>  0:04
   :END:      
   :PROPERTIES:
   :Effort:   0:30
   :END:
** DONE add symbol table and program code array
   CLOSED: [2017-03-01 Wed 13:11]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-01 Wed 12:59]--[2017-03-01 Wed 13:11] =>  0:12
   CLOCK: [2017-03-01 Wed 11:31]--[2017-03-01 Wed 11:45] =>  0:14
   :END:      
   :PROPERTIES:
   :Effort:   1:00
   :END:
** DONE labels support to LUI
   CLOSED: [2017-03-09 Thu 11:17]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-08 Wed 09:02]--[2017-03-08 Wed 10:00] =>  0:58
   :END:      
   :PROPERTIES:
   :Effort:   1:00
   :END:
** DONE labels support
   CLOSED: [2017-03-16 Thu 10:05]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-16 Thu 10:04]--[2017-03-16 Thu 10:05] =>  0:01
   CLOCK: [2017-03-16 Thu 09:49]--[2017-03-16 Thu 09:52] =>  0:03
   CLOCK: [2017-03-16 Thu 09:39]--[2017-03-16 Thu 09:40] =>  0:01
   CLOCK: [2017-03-13 Mon 10:32]--[2017-03-13 Mon 10:39] =>  0:07
   :END:      
   :PROPERTIES:
   :Effort:   3:45
   :END:
*** DONE AUIPC
    CLOSED: [2017-03-09 Thu 12:20]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 11:38]--[2017-03-09 Thu 11:45] =>  0:07
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LB
    CLOSED: [2017-03-09 Thu 12:32]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 12:21]--[2017-03-09 Thu 12:32] =>  0:11
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LH
    CLOSED: [2017-03-09 Thu 17:32]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 12:34]--[2017-03-09 Thu 13:04] =>  0:30
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LW
    CLOSED: [2017-03-09 Thu 18:06]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 17:32]--[2017-03-09 Thu 17:57] =>  0:25
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SB
    CLOSED: [2017-03-13 Mon 10:45]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-13 Mon 10:39]--[2017-03-13 Mon 10:45] =>  0:06
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SH
    CLOSED: [2017-03-13 Mon 10:32]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-13 Mon 10:13]--[2017-03-13 Mon 10:32] =>  0:19
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SW
    CLOSED: [2017-03-10 Fri 10:26]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-10 Fri 10:10]--[2017-03-10 Fri 10:26] =>  0:16
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SLTI
    CLOSED: [2017-03-13 Mon 12:41]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-13 Mon 10:45]--[2017-03-13 Mon 11:03] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SLTIU
    CLOSED: [2017-03-14 Tue 10:39]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-14 Tue 10:11]--[2017-03-14 Tue 10:39] =>  0:28
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE XORI
    CLOSED: [2017-03-15 Wed 12:35]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-15 Wed 12:30]--[2017-03-15 Wed 12:35] =>  0:05
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE ORI
    CLOSED: [2017-03-15 Wed 12:45]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-15 Wed 12:42]--[2017-03-15 Wed 12:45] =>  0:03
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE ANDI
    CLOSED: [2017-03-16 Thu 09:21]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-16 Thu 09:18]--[2017-03-16 Thu 09:21] =>  0:03
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SLLI
    CLOSED: [2017-03-16 Thu 09:24]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-16 Thu 09:21]--[2017-03-16 Thu 09:24] =>  0:03
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SRLI
    CLOSED: [2017-03-16 Thu 09:39]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-16 Thu 09:25]--[2017-03-16 Thu 09:39] =>  0:14
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SRAI
    CLOSED: [2017-03-16 Thu 09:49]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-16 Thu 09:40]--[2017-03-16 Thu 09:49] =>  0:09
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE ADDI
    CLOSED: [2017-03-16 Thu 10:04]
    :PROPERTIES:
    :END:
    :LOGBOOK:  
    CLOCK: [2017-03-16 Thu 09:52]--[2017-03-16 Thu 10:04] =>  0:12
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** CANCELLED SLL                                                 :CANCELLED:
    CLOSED: [2017-03-16 Thu 09:18]
    :PROPERTIES:
    :END:
    - State "CANCELLED"  from "TODO"       [2017-03-16 Thu 09:18]
    :LOGBOOK:  
    CLOCK: [2017-02-01 Wed 16:33]--[2017-02-01 Wed 17:57] =>  1:24
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
** DONE add dw to assembler
   CLOSED: [2017-03-10 Fri 10:10]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-03-09 Thu 18:23]--[2017-03-09 Thu 19:00] =>  0:37
   :END:      
   :PROPERTIES:
   :Effort:   0:30
   :END:
** DONE add immediate boundary check [37/37]
   CLOSED: [2017-04-04 Tue 09:11]
   :PROPERTIES:
   :END:
   :LOGBOOK:  
   CLOCK: [2017-04-04 Tue 09:01]--[2017-04-04 Tue 09:11] =>  0:10
   CLOCK: [2017-04-03 Mon 11:59]--[2017-04-03 Mon 12:49] =>  0:50
   CLOCK: [2017-03-31 Fri 12:25]--[2017-03-31 Fri 12:45] =>  0:20
   CLOCK: [2017-03-30 Thu 08:32]--[2017-03-30 Thu 09:19] =>  0:47
   :END:      
   :PROPERTIES:
   :Effort:   2:00
   :END:
   - [X] LUIpattern
   - [X] ADDpattern
   - [X] SWpattern
   - [X] LWpattern
   - [X] LHpattern
   - [X] SUBpattern
   - [X] SLLpattern
   - [X] ORIpattern
   - [X] ANDIpattern
   - [X] SLLIpattern
   - [X] SRLIpattern
   - [X] SRAIpattern
   - [X] ADDIpattern
   - [X] XORIpattern
   - [X] XORpattern
   - [X] ORpattern
   - [X] ANDpattern
   - [X] SLTIpattern
   - [X] SLTIUpattern
   - [X] SLTpattern
   - [X] SLTUpattern
   - [X] LBpattern
   - [X] SBpattern
   - [X] SHpattern
   - [X] LBUpattern
   - [X] LHUpattern
   - [X] SRLpattern
   - [X] SRApattern
   - [X] AUIPCpattern
   - [X] JALpattern
   - [X] JALRpattern
   - [X] BEQpattern
   - [X] BNEpattern
   - [X] BLTpattern
   - [X] BGEpattern
   - [X] BLTUpattern
   - [X] BGEUpattern

** TODO fix bug in immediate boundary check [37/37]
   :PROPERTIES:
   :Effort:   2:00
   :END:
   :LOGBOOK:  
   CLOCK: [2017-04-04 Tue 09:01]--[2017-04-04 Tue 09:11] =>  0:10
   CLOCK: [2017-04-03 Mon 11:59]--[2017-04-03 Mon 12:49] =>  0:50
   CLOCK: [2017-03-31 Fri 12:25]--[2017-03-31 Fri 12:45] =>  0:20
   CLOCK: [2017-03-30 Thu 08:32]--[2017-03-30 Thu 09:19] =>  0:47
   :END:      
   Labels are not yet fixed
   - [X] LUIpattern
   - [X] ADDpattern
   - [X] SWpattern
   - [X] LWpattern
   - [X] LHpattern
   - [X] SUBpattern
   - [X] SLLpattern
   - [X] ORIpattern
   - [X] ANDIpattern
   - [X] SLLIpattern
   - [X] SRLIpattern
   - [X] SRAIpattern
   - [X] ADDIpattern
   - [X] XORIpattern
   - [X] XORpattern
   - [X] ORpattern
   - [X] ANDpattern
   - [X] SLTIpattern
   - [X] SLTIUpattern
   - [X] SLTpattern
   - [X] SLTUpattern
   - [X] LBpattern
   - [X] SBpattern
   - [X] SHpattern
   - [X] LBUpattern
   - [X] LHUpattern
   - [X] SRLpattern
   - [X] SRApattern
   - [X] AUIPCpattern
   - [X] JALpattern
   - [X] JALRpattern
   - [X] BEQpattern
   - [X] BNEpattern
   - [X] BLTpattern
   - [X] BGEpattern
   - [X] BLTUpattern
   - [X] BGEUpattern

